ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157fxx_cm4.h
/***************  Bit definition for DDRCTRL_DRAMTMG7 register  ***************/
#define DDRCTRL_DRAMTMG7_T_CKPDX_Pos (0U)
#define DDRCTRL_DRAMTMG7_T_CKPDX_Msk (0xFU << DDRCTRL_DRAMTMG7_T_CKPDX_Pos) /*!< 0x0000000F */
#define DDRCTRL_DRAMTMG7_T_CKPDX     DDRCTRL_DRAMTMG7_T_CKPDX_Msk           /*!< This is the time before Power Down Exit that CK is maintained as a valid clock before issuing PDX. Specifies the clock stable time before PDX. */
#define DDRCTRL_DRAMTMG7_T_CKPDX_0   (0x1U << DDRCTRL_DRAMTMG7_T_CKPDX_Pos) /*!< 0x00000001 */
#define DDRCTRL_DRAMTMG7_T_CKPDX_1   (0x2U << DDRCTRL_DRAMTMG7_T_CKPDX_Pos) /*!< 0x00000002 */
#define DDRCTRL_DRAMTMG7_T_CKPDX_2   (0x4U << DDRCTRL_DRAMTMG7_T_CKPDX_Pos) /*!< 0x00000004 */
#define DDRCTRL_DRAMTMG7_T_CKPDX_3   (0x8U << DDRCTRL_DRAMTMG7_T_CKPDX_Pos) /*!< 0x00000008 */
#define DDRCTRL_DRAMTMG7_T_CKPDE_Pos (8U)
#define DDRCTRL_DRAMTMG7_T_CKPDE_Msk (0xFU << DDRCTRL_DRAMTMG7_T_CKPDE_Pos) /*!< 0x00000F00 */
#define DDRCTRL_DRAMTMG7_T_CKPDE     DDRCTRL_DRAMTMG7_T_CKPDE_Msk           /*!< This is the time after Power Down Entry that CK is maintained as a valid clock. Specifies the clock disable delay after PDE. */
#define DDRCTRL_DRAMTMG7_T_CKPDE_0   (0x1U << DDRCTRL_DRAMTMG7_T_CKPDE_Pos) /*!< 0x00000100 */
#define DDRCTRL_DRAMTMG7_T_CKPDE_1   (0x2U << DDRCTRL_DRAMTMG7_T_CKPDE_Pos) /*!< 0x00000200 */
#define DDRCTRL_DRAMTMG7_T_CKPDE_2   (0x4U << DDRCTRL_DRAMTMG7_T_CKPDE_Pos) /*!< 0x00000400 */
#define DDRCTRL_DRAMTMG7_T_CKPDE_3   (0x8U << DDRCTRL_DRAMTMG7_T_CKPDE_Pos) /*!< 0x00000800 */

/***************  Bit definition for DDRCTRL_DRAMTMG8 register  ***************/
#define DDRCTRL_DRAMTMG8_T_XS_X32_Pos     (0U)
#define DDRCTRL_DRAMTMG8_T_XS_X32_Msk     (0x7FU << DDRCTRL_DRAMTMG8_T_XS_X32_Pos)     /*!< 0x0000007F */
#define DDRCTRL_DRAMTMG8_T_XS_X32         DDRCTRL_DRAMTMG8_T_XS_X32_Msk                /*!< tXS: Exit Self Refresh to commands not requiring a locked DLL. */
#define DDRCTRL_DRAMTMG8_T_XS_X32_0       (0x1U << DDRCTRL_DRAMTMG8_T_XS_X32_Pos)      /*!< 0x00000001 */
#define DDRCTRL_DRAMTMG8_T_XS_X32_1       (0x2U << DDRCTRL_DRAMTMG8_T_XS_X32_Pos)      /*!< 0x00000002 */
#define DDRCTRL_DRAMTMG8_T_XS_X32_2       (0x4U << DDRCTRL_DRAMTMG8_T_XS_X32_Pos)      /*!< 0x00000004 */
#define DDRCTRL_DRAMTMG8_T_XS_X32_3       (0x8U << DDRCTRL_DRAMTMG8_T_XS_X32_Pos)      /*!< 0x00000008 */
#define DDRCTRL_DRAMTMG8_T_XS_X32_4       (0x10U << DDRCTRL_DRAMTMG8_T_XS_X32_Pos)     /*!< 0x00000010 */
#define DDRCTRL_DRAMTMG8_T_XS_X32_5       (0x20U << DDRCTRL_DRAMTMG8_T_XS_X32_Pos)     /*!< 0x00000020 */
#define DDRCTRL_DRAMTMG8_T_XS_X32_6       (0x40U << DDRCTRL_DRAMTMG8_T_XS_X32_Pos)     /*!< 0x00000040 */
#define DDRCTRL_DRAMTMG8_T_XS_DLL_X32_Pos (8U)
#define DDRCTRL_DRAMTMG8_T_XS_DLL_X32_Msk (0x7FU << DDRCTRL_DRAMTMG8_T_XS_DLL_X32_Pos) /*!< 0x00007F00 */
#define DDRCTRL_DRAMTMG8_T_XS_DLL_X32     DDRCTRL_DRAMTMG8_T_XS_DLL_X32_Msk            /*!< tXSDLL: Exit Self Refresh to the commands requiring a locked DLL. */
#define DDRCTRL_DRAMTMG8_T_XS_DLL_X32_0   (0x1U << DDRCTRL_DRAMTMG8_T_XS_DLL_X32_Pos)  /*!< 0x00000100 */
#define DDRCTRL_DRAMTMG8_T_XS_DLL_X32_1   (0x2U << DDRCTRL_DRAMTMG8_T_XS_DLL_X32_Pos)  /*!< 0x00000200 */
#define DDRCTRL_DRAMTMG8_T_XS_DLL_X32_2   (0x4U << DDRCTRL_DRAMTMG8_T_XS_DLL_X32_Pos)  /*!< 0x00000400 */
#define DDRCTRL_DRAMTMG8_T_XS_DLL_X32_3   (0x8U << DDRCTRL_DRAMTMG8_T_XS_DLL_X32_Pos)  /*!< 0x00000800 */
#define DDRCTRL_DRAMTMG8_T_XS_DLL_X32_4   (0x10U << DDRCTRL_DRAMTMG8_T_XS_DLL_X32_Pos) /*!< 0x00001000 */
#define DDRCTRL_DRAMTMG8_T_XS_DLL_X32_5   (0x20U << DDRCTRL_DRAMTMG8_T_XS_DLL_X32_Pos) /*!< 0x00002000 */
#define DDRCTRL_DRAMTMG8_T_XS_DLL_X32_6   (0x40U << DDRCTRL_DRAMTMG8_T_XS_DLL_X32_Pos) /*!< 0x00004000 */

/**************  Bit definition for DDRCTRL_DRAMTMG14 register  ***************/
#define DDRCTRL_DRAMTMG14_T_XSR_Pos (0U)
#define DDRCTRL_DRAMTMG14_T_XSR_Msk (0xFFFU << DDRCTRL_DRAMTMG14_T_XSR_Pos) /*!< 0x00000FFF */
#define DDRCTRL_DRAMTMG14_T_XSR     DDRCTRL_DRAMTMG14_T_XSR_Msk             /*!< tXSR: Exit Self Refresh to any command. */
#define DDRCTRL_DRAMTMG14_T_XSR_0   (0x1U << DDRCTRL_DRAMTMG14_T_XSR_Pos)   /*!< 0x00000001 */
#define DDRCTRL_DRAMTMG14_T_XSR_1   (0x2U << DDRCTRL_DRAMTMG14_T_XSR_Pos)   /*!< 0x00000002 */
#define DDRCTRL_DRAMTMG14_T_XSR_2   (0x4U << DDRCTRL_DRAMTMG14_T_XSR_Pos)   /*!< 0x00000004 */
#define DDRCTRL_DRAMTMG14_T_XSR_3   (0x8U << DDRCTRL_DRAMTMG14_T_XSR_Pos)   /*!< 0x00000008 */
#define DDRCTRL_DRAMTMG14_T_XSR_4   (0x10U << DDRCTRL_DRAMTMG14_T_XSR_Pos)  /*!< 0x00000010 */
#define DDRCTRL_DRAMTMG14_T_XSR_5   (0x20U << DDRCTRL_DRAMTMG14_T_XSR_Pos)  /*!< 0x00000020 */
#define DDRCTRL_DRAMTMG14_T_XSR_6   (0x40U << DDRCTRL_DRAMTMG14_T_XSR_Pos)  /*!< 0x00000040 */
#define DDRCTRL_DRAMTMG14_T_XSR_7   (0x80U << DDRCTRL_DRAMTMG14_T_XSR_Pos)  /*!< 0x00000080 */
#define DDRCTRL_DRAMTMG14_T_XSR_8   (0x100U << DDRCTRL_DRAMTMG14_T_XSR_Pos) /*!< 0x00000100 */
#define DDRCTRL_DRAMTMG14_T_XSR_9   (0x200U << DDRCTRL_DRAMTMG14_T_XSR_Pos) /*!< 0x00000200 */
#define DDRCTRL_DRAMTMG14_T_XSR_10  (0x400U << DDRCTRL_DRAMTMG14_T_XSR_Pos) /*!< 0x00000400 */
#define DDRCTRL_DRAMTMG14_T_XSR_11  (0x800U << DDRCTRL_DRAMTMG14_T_XSR_Pos) /*!< 0x00000800 */

/**************  Bit definition for DDRCTRL_DRAMTMG15 register  ***************/
#define DDRCTRL_DRAMTMG15_T_STAB_X32_Pos       (0U)
#define DDRCTRL_DRAMTMG15_T_STAB_X32_Msk       (0xFFU << DDRCTRL_DRAMTMG15_T_STAB_X32_Pos)      /*!< 0x000000FF */
#define DDRCTRL_DRAMTMG15_T_STAB_X32           DDRCTRL_DRAMTMG15_T_STAB_X32_Msk                 /*!< tSTAB: Stabilization time. */
#define DDRCTRL_DRAMTMG15_T_STAB_X32_0         (0x1U << DDRCTRL_DRAMTMG15_T_STAB_X32_Pos)       /*!< 0x00000001 */
#define DDRCTRL_DRAMTMG15_T_STAB_X32_1         (0x2U << DDRCTRL_DRAMTMG15_T_STAB_X32_Pos)       /*!< 0x00000002 */
#define DDRCTRL_DRAMTMG15_T_STAB_X32_2         (0x4U << DDRCTRL_DRAMTMG15_T_STAB_X32_Pos)       /*!< 0x00000004 */
#define DDRCTRL_DRAMTMG15_T_STAB_X32_3         (0x8U << DDRCTRL_DRAMTMG15_T_STAB_X32_Pos)       /*!< 0x00000008 */
#define DDRCTRL_DRAMTMG15_T_STAB_X32_4         (0x10U << DDRCTRL_DRAMTMG15_T_STAB_X32_Pos)      /*!< 0x00000010 */
#define DDRCTRL_DRAMTMG15_T_STAB_X32_5         (0x20U << DDRCTRL_DRAMTMG15_T_STAB_X32_Pos)      /*!< 0x00000020 */
#define DDRCTRL_DRAMTMG15_T_STAB_X32_6         (0x40U << DDRCTRL_DRAMTMG15_T_STAB_X32_Pos)      /*!< 0x00000040 */
#define DDRCTRL_DRAMTMG15_T_STAB_X32_7         (0x80U << DDRCTRL_DRAMTMG15_T_STAB_X32_Pos)      /*!< 0x00000080 */
#define DDRCTRL_DRAMTMG15_EN_DFI_LP_T_STAB_Pos (31U)
#define DDRCTRL_DRAMTMG15_EN_DFI_LP_T_STAB_Msk (0x1U << DDRCTRL_DRAMTMG15_EN_DFI_LP_T_STAB_Pos) /*!< 0x80000000 */
#define DDRCTRL_DRAMTMG15_EN_DFI_LP_T_STAB     DDRCTRL_DRAMTMG15_EN_DFI_LP_T_STAB_Msk           /*!< - 1 - Enable using tSTAB when exiting DFI LP. Needs to be set when the PHY is stopping the clock during DFI LP to save maximum power. */

/****************  Bit definition for DDRCTRL_ZQCTL0 register  ****************/
#define DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_Pos     (0U)
#define DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_Msk     (0x3FFU << DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_Pos)   /*!< 0x000003FF */
#define DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP         DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_Msk               /*!< tZQCS for DDR3/DD4/LPDDR2/LPDDR3, tZQLAT for LPDDR4: Number of DFI clock cycles of NOP required after a ZQCS (ZQ calibration short)/MPC(ZQ Latch) command is issued to SDRAM. */
#define DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_0       (0x1U << DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_Pos)     /*!< 0x00000001 */
#define DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_1       (0x2U << DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_Pos)     /*!< 0x00000002 */
#define DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_2       (0x4U << DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_Pos)     /*!< 0x00000004 */
#define DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_3       (0x8U << DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_Pos)     /*!< 0x00000008 */
#define DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_4       (0x10U << DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_Pos)    /*!< 0x00000010 */
#define DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_5       (0x20U << DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_Pos)    /*!< 0x00000020 */
#define DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_6       (0x40U << DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_Pos)    /*!< 0x00000040 */
#define DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_7       (0x80U << DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_Pos)    /*!< 0x00000080 */
#define DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_8       (0x100U << DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_Pos)   /*!< 0x00000100 */
#define DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_9       (0x200U << DDRCTRL_ZQCTL0_T_ZQ_SHORT_NOP_Pos)   /*!< 0x00000200 */
#define DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Pos      (16U)
#define DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Msk      (0x7FFU << DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Pos)    /*!< 0x07FF0000 */
#define DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP          DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Msk                /*!< tZQoper for DDR3/DDR4, tZQCL for LPDDR2/LPDDR3, tZQCAL for LPDDR4: Number of DFI clock cycles of NOP required after a ZQCL (ZQ calibration long)/MPC(ZQ Start) command is issued to SDRAM. */
#define DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_0        (0x1U << DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Pos)      /*!< 0x00010000 */
#define DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_1        (0x2U << DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Pos)      /*!< 0x00020000 */
#define DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_2        (0x4U << DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Pos)      /*!< 0x00040000 */
#define DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_3        (0x8U << DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Pos)      /*!< 0x00080000 */
#define DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_4        (0x10U << DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Pos)     /*!< 0x00100000 */
#define DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_5        (0x20U << DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Pos)     /*!< 0x00200000 */
#define DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_6        (0x40U << DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Pos)     /*!< 0x00400000 */
#define DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_7        (0x80U << DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Pos)     /*!< 0x00800000 */
#define DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_8        (0x100U << DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Pos)    /*!< 0x01000000 */
#define DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_9        (0x200U << DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Pos)    /*!< 0x02000000 */
#define DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_10       (0x400U << DDRCTRL_ZQCTL0_T_ZQ_LONG_NOP_Pos)    /*!< 0x04000000 */
#define DDRCTRL_ZQCTL0_ZQ_RESISTOR_SHARED_Pos (29U)
#define DDRCTRL_ZQCTL0_ZQ_RESISTOR_SHARED_Msk (0x1U << DDRCTRL_ZQCTL0_ZQ_RESISTOR_SHARED_Pos) /*!< 0x20000000 */
#define DDRCTRL_ZQCTL0_ZQ_RESISTOR_SHARED     DDRCTRL_ZQCTL0_ZQ_RESISTOR_SHARED_Msk           /*!< - 1 - Denotes that ZQ resistor is shared between ranks. Means ZQinit/ZQCL/ZQCS/MPC(ZQ calibration) commands are sent to one rank at a time with tZQinit/tZQCL/tZQCS/tZQCAL/tZQLAT timing met between commands so that commands to different ranks do not overlap. */
#define DDRCTRL_ZQCTL0_DIS_SRX_ZQCL_Pos       (30U)
#define DDRCTRL_ZQCTL0_DIS_SRX_ZQCL_Msk       (0x1U << DDRCTRL_ZQCTL0_DIS_SRX_ZQCL_Pos)       /*!< 0x40000000 */
#define DDRCTRL_ZQCTL0_DIS_SRX_ZQCL           DDRCTRL_ZQCTL0_DIS_SRX_ZQCL_Msk                 /*!< - 1 - Disable issuing of ZQCL/MPC(ZQ calibration) command at Self-Refresh/SR-Powerdown exit. Only applicable when run in DDR3 or DDR4 or LPDDR2 or LPDDR3 or LPDDR4 mode. */
#define DDRCTRL_ZQCTL0_DIS_AUTO_ZQ_Pos        (31U)
#define DDRCTRL_ZQCTL0_DIS_AUTO_ZQ_Msk        (0x1U << DDRCTRL_ZQCTL0_DIS_AUTO_ZQ_Pos)        /*!< 0x80000000 */
#define DDRCTRL_ZQCTL0_DIS_AUTO_ZQ            DDRCTRL_ZQCTL0_DIS_AUTO_ZQ_Msk                  /*!< - 1 - Disable DDRCTRL generation of ZQCS/MPC(ZQ calibration) command. Register DBGCMD.zq_calib_short can be used instead to issue ZQ calibration request from APB module. */

/****************  Bit definition for DDRCTRL_ZQCTL1 register  ****************/
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos (0U)
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Msk (0xFFFFFU << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos) /*!< 0x000FFFFF */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024     DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Msk               /*!< Average interval to wait between automatically issuing ZQCS (ZQ calibration short)/MPC(ZQ calibration) commands to DDR3/DDR4/LPDDR2/LPDDR3/LPDDR4 devices. */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_0   (0x1U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)     /*!< 0x00000001 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_1   (0x2U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)     /*!< 0x00000002 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_2   (0x4U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)     /*!< 0x00000004 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_3   (0x8U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)     /*!< 0x00000008 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_4   (0x10U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)    /*!< 0x00000010 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_5   (0x20U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)    /*!< 0x00000020 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_6   (0x40U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)    /*!< 0x00000040 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_7   (0x80U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)    /*!< 0x00000080 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_8   (0x100U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)   /*!< 0x00000100 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_9   (0x200U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)   /*!< 0x00000200 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_10  (0x400U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)   /*!< 0x00000400 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_11  (0x800U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)   /*!< 0x00000800 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_12  (0x1000U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)  /*!< 0x00001000 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_13  (0x2000U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)  /*!< 0x00002000 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_14  (0x4000U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)  /*!< 0x00004000 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_15  (0x8000U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos)  /*!< 0x00008000 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_16  (0x10000U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos) /*!< 0x00010000 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_17  (0x20000U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos) /*!< 0x00020000 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_18  (0x40000U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos) /*!< 0x00040000 */
#define DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_19  (0x80000U << DDRCTRL_ZQCTL1_T_ZQ_SHORT_INTERVAL_X1024_Pos) /*!< 0x00080000 */
#define DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_Pos            (20U)
#define DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_Msk            (0x3FFU << DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_Pos)              /*!< 0x3FF00000 */
#define DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP                DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_Msk                          /*!< tZQReset: Number of DFI clock cycles of NOP required after a ZQReset (ZQ calibration Reset) command is issued to SDRAM. */
#define DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_0              (0x1U << DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_Pos)                /*!< 0x00100000 */
#define DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_1              (0x2U << DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_Pos)                /*!< 0x00200000 */
#define DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_2              (0x4U << DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_Pos)                /*!< 0x00400000 */
#define DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_3              (0x8U << DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_Pos)                /*!< 0x00800000 */
#define DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_4              (0x10U << DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_Pos)               /*!< 0x01000000 */
#define DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_5              (0x20U << DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_Pos)               /*!< 0x02000000 */
#define DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_6              (0x40U << DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_Pos)               /*!< 0x04000000 */
#define DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_7              (0x80U << DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_Pos)               /*!< 0x08000000 */
#define DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_8              (0x100U << DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_Pos)              /*!< 0x10000000 */
#define DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_9              (0x200U << DDRCTRL_ZQCTL1_T_ZQ_RESET_NOP_Pos)              /*!< 0x20000000 */

/****************  Bit definition for DDRCTRL_ZQCTL2 register  ****************/
#define DDRCTRL_ZQCTL2_ZQ_RESET_Pos (0U)
#define DDRCTRL_ZQCTL2_ZQ_RESET_Msk (0x1U << DDRCTRL_ZQCTL2_ZQ_RESET_Pos) /*!< 0x00000001 */
#define DDRCTRL_ZQCTL2_ZQ_RESET     DDRCTRL_ZQCTL2_ZQ_RESET_Msk           /*!< Setting this register bit to 1 triggers a ZQ Reset operation. When the ZQ Reset operation is complete, the DDRCTRL automatically clears this bit. It is recommended NOT to set this register bit if in Init, in Self-Refresh(except LPDDR4) or SR-Powerdown(LPDDR4) or Deep power-down operating modes. */

